---
kind: type
id: T:Autodesk.Revit.DB.SpacingRule
source: html/d8a51fa2-f3cd-5f12-d8cc-87c3888570f9.htm
---
# Autodesk.Revit.DB.SpacingRule

A rule for specifying a set of equidistant,
parallel gridlines within a region.

## Syntax (C#)
```csharp
public class SpacingRule : APIObject
```